#ТерВер и МатСтат

import math
import numpy as np

#   Практическое задание №3 для 1 урока
#   Семь человеĸ рассаживаются наудачу на сĸамейĸе.
#   Каĸова вероятность того,
#   что два определённых человеĸа будут сидеть рядом?
#
#   Вероятность,что я сяду на какое-то конкретное место =1/7
#   вероятность, что рядом окажется мой товарищ =2/6,
#   кроме крайних мест, там =1/6
#   Сложим все вероятности
#   Р=2*(1/7*1/6)+5*(1/7*2/6)
p = 2*((1/7)*(1/6)) + 5*((1/7)*(2/6))
print ('Задание №3')
print ('вероятность, что рядом окажется мой товарищ', p)
