#ТерВер и МатСтат

import math
import numpy as np

#   Практическое задание №4 для 1 урока
#   Из 60 вопросов, входящих в эĸзаменационные билеты,
#   студент знает 50.
#   Каĸова вероятность того,
#   что среди трёх наугад выбранных вопросов студент знает:
#   а) все?
#   б) два?
#
def combinations (n,k):
    return np.math.factorial(n) // (np.math.factorial(k) * np.math.factorial(n-k))

#   Сочетание 3-х ответов из 60:
p1=combinations (60,3)
#   Сочетание 3-х ответов из 50:
p2=combinations (50,3)
#   вероятность, что все ответы правильные
p=p2/p1

print ('Задание №4')
print ('вероятность, что три ответа правильные',p)

#   Сочетание 2-х ответов из 50:
p2=combinations (50,2)
#   Сочетание 1 ответа из 10  (третий ответ неправильный):
p3=combinations (10,1)
#   вероятность, что два ответа правильные
p=p2*p3/p1

print ('вероятность, что два ответа правильные',p)
