#ТерВер и МатСтат

import math
import numpy as np

#   Практическое задание №6 для 1 урока
#   Допустим, имеется неĸоторая очень редĸая болезнь (поражает 0.1 % населения).
#   Вы приходите ĸ врачу, вам делают тест на эту болезнь,
#   и тест оĸазывается положительным.
#   Врач говорит вам, что этот тест верно выявляет 99 % больных этой болезнью
#   и всего лишь в 1 % случаев даёт ложный положительный ответ.
#
#   Вопрос: ĸаĸова вероятность, что вы действительно больны ей?
#
#   Применим формулу Байеса
#   Р(А) = вероятность, что тест положительный
#   Р(В) = вероятность, что человек действительно заболел
#   Р(В|А) = вероятность, что чел-к болен, если тест положительный
#
#   Р(А) = Р(В)*Н1 + Р(не В)*Н2
#   Р(не В) = вероятность, что человек здоров
#   Н1 = точность теста, насколько вероятно тест обнаружит больного
#   Н2 = точность теста, насколько вероятно результат будет ложный

pa = (1/1000)*0.99 + (999/1000)*0.01
pb = 0.001
pab = 0.99

p = (pab*pb)/pa

print ('Задание №6')
print ('вероятность, что человек действительно болен', p)
